org/portfolio_composition.org
#+SETUPFILE:./hugo_setup.org
#+TITLE: Portfolio Composition

* General recommendations

1. Invest in ETFs, not single stocks  ([[file:investing_in_etfs.org][§investing_in_etfs]])
2. Invest "110 minus your age" into stocks, and the rest into bonds
3. For the stock component, half should be in local-stock ETF and half
   in global stock ETF
   1. Global stock ETF is inherently more volatile, affected by
      currency
4. The bond component should be entirely local

* Good ETFs
- SPDR Straits Times Index ETF: ES3
  - big, liquid, 0.3% expense ratio
- MBH, Nikko Asset Management SGD Investment-Grade Corporate Bond ETF
- IWDA, the iShares Core MSCI World ETF
  - invests in every developed market in the world, 0.2% expense ratio
